results/freebsd/compute_low.txt
Running 1m test @ http://192.168.122.142:3000/compute
  4 threads and 50 connections
  Thread calibration: mean lat.: 0.830ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.837ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.837ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.857ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   849.12us  417.97us   3.80ms   65.40%
    Req/Sec   530.10     84.34     0.89k    61.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  847.00us
 75.000%    1.13ms
 90.000%    1.40ms
 99.000%    1.87ms
 99.900%    2.10ms
 99.990%    2.59ms
 99.999%    2.89ms
100.000%    3.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.035     0.000000            1         1.00
       0.293     0.100000        10004         1.11
       0.439     0.200000        20021         1.25
       0.590     0.300000        29970         1.43
       0.732     0.400000        39987         1.67
       0.847     0.500000        50005         2.00
       0.899     0.550000        54941         2.22
       0.955     0.600000        59951         2.50
       1.017     0.650000        64957         2.86
       1.074     0.700000        69927         3.33
       1.131     0.750000        74909         4.00
       1.160     0.775000        77414         4.44
       1.191     0.800000        79907         5.00
       1.228     0.825000        82438         5.71
       1.273     0.850000        84906         6.67
       1.331     0.875000        87410         8.00
       1.366     0.887500        88651         8.89
       1.405     0.900000        89919        10.00
       1.444     0.912500        91145        11.43
       1.486     0.925000        92399        13.33
       1.532     0.937500        93658        16.00
       1.557     0.943750        94261        17.78
       1.583     0.950000        94884        20.00
       1.614     0.956250        95507        22.86
       1.647     0.962500        96134        26.67
       1.683     0.968750        96759        32.00
       1.704     0.971875        97077        35.56
       1.729     0.975000        97380        40.00
       1.754     0.978125        97695        45.71
       1.784     0.981250        98006        53.33
       1.809     0.984375        98322        64.00
       1.826     0.985938        98479        71.11
       1.843     0.987500        98629        80.00
       1.860     0.989062        98786        91.43
       1.881     0.990625        98942       106.67
       1.904     0.992188        99103       128.00
       1.915     0.992969        99176       142.22
       1.927     0.993750        99254       160.00
       1.944     0.994531        99332       182.86
       1.962     0.995313        99415       213.33
       1.979     0.996094        99487       256.00
       1.990     0.996484        99525       284.44
       2.003     0.996875        99565       320.00
       2.013     0.997266        99605       365.71
       2.028     0.997656        99643       426.67
       2.046     0.998047        99683       512.00
       2.053     0.998242        99701       568.89
       2.067     0.998437        99722       640.00
       2.077     0.998633        99742       731.43
       2.089     0.998828        99760       853.33
       2.103     0.999023        99779      1024.00
       2.119     0.999121        99789      1137.78
       2.131     0.999219        99799      1280.00
       2.153     0.999316        99809      1462.86
       2.167     0.999414        99821      1706.67
       2.181     0.999512        99829      2048.00
       2.195     0.999561        99833      2275.56
       2.217     0.999609        99837      2560.00
       2.227     0.999658        99843      2925.71
       2.249     0.999707        99847      3413.33
       2.301     0.999756        99852      4096.00
       2.371     0.999780        99856      4551.11
       2.441     0.999805        99857      5120.00
       2.473     0.999829        99859      5851.43
       2.527     0.999854        99862      6826.67
       2.547     0.999878        99864      8192.00
       2.587     0.999890        99866      9102.22
       2.589     0.999902        99867     10240.00
       2.647     0.999915        99868     11702.86
       2.677     0.999927        99869     13653.33
       2.685     0.999939        99870     16384.00
       2.715     0.999945        99871     18204.44
       2.737     0.999951        99872     20480.00
       2.737     0.999957        99872     23405.71
       2.767     0.999963        99873     27306.67
       2.767     0.999969        99873     32768.00
       2.827     0.999973        99874     36408.89
       2.827     0.999976        99874     40960.00
       2.827     0.999979        99874     46811.43
       2.887     0.999982        99875     54613.33
       2.887     0.999985        99875     65536.00
       2.887     0.999986        99875     72817.78
       2.887     0.999988        99875     81920.00
       2.887     0.999989        99875     93622.86
       3.801     0.999991        99876    109226.67
       3.801     1.000000        99876          inf
#[Mean    =        0.849, StdDeviation   =        0.418]
#[Max     =        3.800, Total count    =        99876]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119968 requests in 1.00m, 14.64MB read
Requests/sec:   1999.41
Transfer/sec:    249.93KB