results/freebsd/concurrent_high.txt
Running 1m test @ http://192.168.122.142:3000/concurrent
  8 threads and 500 connections
  Thread calibration: mean lat.: 3110.010ms, rate sampling interval: 11247ms
  Thread calibration: mean lat.: 3094.950ms, rate sampling interval: 11280ms
  Thread calibration: mean lat.: 3070.652ms, rate sampling interval: 11182ms
  Thread calibration: mean lat.: 3084.149ms, rate sampling interval: 11255ms
  Thread calibration: mean lat.: 3104.090ms, rate sampling interval: 11255ms
  Thread calibration: mean lat.: 3096.255ms, rate sampling interval: 11329ms
  Thread calibration: mean lat.: 3147.463ms, rate sampling interval: 11386ms
  Thread calibration: mean lat.: 3030.392ms, rate sampling interval: 11124ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.55s     9.66s   40.44s    56.22%
    Req/Sec   427.78     33.53   471.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   23.00s 
 75.000%   30.80s 
 90.000%   35.88s 
 99.000%   38.73s 
 99.900%   39.52s 
 99.990%   40.01s 
 99.999%   40.30s 
100.000%   40.47s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5668.863     0.000000            1         1.00
    9125.887     0.100000        17140         1.11
   11943.935     0.200000        34278         1.25
   15745.023     0.300000        51389         1.43
   19529.727     0.400000        68531         1.67
   23003.135     0.500000        85670         2.00
   24625.151     0.550000        94248         2.22
   26148.863     0.600000       102829         2.50
   27656.191     0.650000       111412         2.86
   29212.671     0.700000       119927         3.33
   30801.919     0.750000       128526         4.00
   31571.967     0.775000       132813         4.44
   32423.935     0.800000       137015         5.00
   33325.055     0.825000       141356         5.71
   34242.559     0.850000       145722         6.67
   35094.527     0.875000       150000         8.00
   35487.743     0.887500       152051         8.89
   35880.959     0.900000       154189        10.00
   36274.175     0.912500       156416        11.43
   36634.623     0.925000       158485        13.33
   37027.839     0.937500       160699        16.00
   37191.679     0.943750       161632        17.78
   37388.287     0.950000       162757        20.00
   37584.895     0.956250       163848        22.86
   37781.503     0.962500       164978        26.67
   37978.111     0.968750       166052        32.00
   38076.415     0.971875       166589        35.56
   38174.719     0.975000       167125        40.00
   38273.023     0.978125       167617        45.71
   38371.327     0.981250       168117        53.33
   38502.399     0.984375       168697        64.00
   38567.935     0.985938       168984        71.11
   38600.703     0.987500       169125        80.00
   38699.007     0.989062       169492        91.43
   38764.543     0.990625       169718       106.67
   38830.079     0.992188       169926       128.00
   38895.615     0.992969       170119       142.22
   38928.383     0.993750       170212       160.00
   38993.919     0.994531       170367       182.86
   39059.455     0.995313       170506       213.33
   39124.991     0.996094       170633       256.00
   39157.759     0.996484       170699       284.44
   39190.527     0.996875       170753       320.00
   39223.295     0.997266       170794       365.71
   39288.831     0.997656       170881       426.67
   39354.367     0.998047       170966       512.00
   39354.367     0.998242       170966       568.89
   39387.135     0.998437       171000       640.00
   39419.903     0.998633       171031       731.43
   39485.439     0.998828       171079       853.33
   39518.207     0.999023       171105      1024.00
   39550.975     0.999121       171123      1137.78
   39583.743     0.999219       171140      1280.00
   39616.511     0.999316       171157      1462.86
   39649.279     0.999414       171168      1706.67
   39682.047     0.999512       171180      2048.00
   39714.815     0.999561       171191      2275.56
   39747.583     0.999609       171201      2560.00
   39780.351     0.999658       171210      2925.71
   39813.119     0.999707       171220      3413.33
   39845.887     0.999756       171226      4096.00
   39845.887     0.999780       171226      4551.11
   39878.655     0.999805       171230      5120.00
   39911.423     0.999829       171234      5851.43
   39944.191     0.999854       171241      6826.67
   39976.959     0.999878       171242      8192.00
   40009.727     0.999890       171246      9102.22
   40009.727     0.999902       171246     10240.00
   40075.263     0.999915       171250     11702.86
   40075.263     0.999927       171250     13653.33
   40140.799     0.999939       171253     16384.00
   40140.799     0.999945       171253     18204.44
   40173.567     0.999951       171255     20480.00
   40173.567     0.999957       171255     23405.71
   40206.335     0.999963       171258     27306.67
   40206.335     0.999969       171258     32768.00
   40206.335     0.999973       171258     36408.89
   40206.335     0.999976       171258     40960.00
   40304.639     0.999979       171260     46811.43
   40304.639     0.999982       171260     54613.33
   40304.639     0.999985       171260     65536.00
   40304.639     0.999986       171260     72817.78
   40304.639     0.999988       171260     81920.00
   40370.175     0.999989       171261     93622.86
   40370.175     0.999991       171261    109226.67
   40370.175     0.999992       171261    131072.00
   40370.175     0.999993       171261    145635.56
   40370.175     0.999994       171261    163840.00
   40468.479     0.999995       171262    187245.71
   40468.479     1.000000       171262          inf
#[Mean    =    22549.644, StdDeviation   =     9661.654]
#[Max     =    40435.712, Total count    =       171262]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  210129 requests in 1.00m, 28.66MB read
Requests/sec:   3501.52
Transfer/sec:    488.98KB